In [2]:
import pandas as pd
import numpy as np

In [14]:
#reading a csv file
df=pd.read_csv('coffee.csv')
df

          Day Coffee Type  Units Sold
0      Monday    Espresso          25
1      Monday       Latte          15
2     Tuesday    Espresso          30
3     Tuesday       Latte          20
4   Wednesday    Espresso          35
5   Wednesday       Latte          25
6    Thursday    Espresso          40
7    Thursday       Latte          30
8      Friday    Espresso          45
9      Friday       Latte          35
10   Saturday    Espresso          45
11   Saturday       Latte          35
12     Sunday    Espresso          45
13     Sunday       Latte          35

In [6]:
df.head()

         Day Coffee Type  Units Sold
0     Monday    Espresso          25
1     Monday       Latte          15
2    Tuesday    Espresso          30
3    Tuesday       Latte          20
4  Wednesday    Espresso          35

In [ ]:
#parquet file are used as they take less space so they improve speed and performance the downside 
#is that they are not very readable like csv or excels

In [7]:
#to get some random samples you can do 
df.sample(4)

         Day Coffee Type  Units Sold
12    Sunday    Espresso          45
9     Friday       Latte          35
3    Tuesday       Latte          20
7   Thursday       Latte          30

In [ ]:
#to access values
#loc -> filter by rows and columns. syntax: <df_name>.loc[rows ,columns_name]
df.loc[:3 , ["Day", "Units Sold"]]

       Day  Units Sold
0   Monday          25
1   Monday          15
2  Tuesday          30
3  Tuesday          20

In [ ]:
#iloc -> uses index instead of column names
#syntax: <df_name>.loc[rows ,columns_index]
df.iloc[5:9,[0,2]]

'''one difference between loc and iloc is that in loc the upper index of the row is inclusive 
but in iloc he uppper index ofrow is exclusive'''

         Day  Units Sold
5  Wednesday          25
6   Thursday          40
7   Thursday          30
8     Friday          45

In [ ]:
#we can change the index (serial number) of the dataframe and put it the same as any of the column

#for example putting day column as index 
df.index= df["Day"]
df.head()

                 Day Coffee Type  Units Sold  (1, Units Sold)
Day
Monday        Monday    Espresso          25               20
Monday        Monday       Latte          15               20
Tuesday      Tuesday    Espresso          30               20
Tuesday      Tuesday       Latte          20               20
Wednesday  Wednesday    Espresso          35               20

In [ ]:
#modifying values
df[1, "Units Sold"]= 20
df.head()

                 Day Coffee Type  Units Sold  (1, Units Sold)
Day
Monday        Monday    Espresso          25               20
Monday        Monday       Latte          15               20
Tuesday      Tuesday    Espresso          30               20
Tuesday      Tuesday       Latte          20               20
Wednesday  Wednesday    Espresso          35               20

In [21]:
#getting specifc values 
df.at[3,"Units Sold"]

np.int64(20)

In [22]:
#getting a specific column
df["Coffee Type"]

0     Espresso
1        Latte
2     Espresso
3        Latte
4     Espresso
5        Latte
6     Espresso
7        Latte
8     Espresso
9        Latte
10    Espresso
11       Latte
12    Espresso
13       Latte
Name: Coffee Type, dtype: str

In [ ]:
#sorting values by columns 
df.sort_values("Units Sold", ascending = False) #sorted in descending order acc to coffee sold

          Day Coffee Type  Units Sold
10   Saturday    Espresso          45
8      Friday    Espresso          45
12     Sunday    Espresso          45
6    Thursday    Espresso          40
4   Wednesday    Espresso          35
11   Saturday       Latte          35
13     Sunday       Latte          35
9      Friday       Latte          35
2     Tuesday    Espresso          30
7    Thursday       Latte          30
0      Monday    Espresso          25
5   Wednesday       Latte          25
3     Tuesday       Latte          20
1      Monday       Latte          15

In [ ]:
#sorting with multiple criterias 
df.sort_values(["Units Sold","Coffee Type"], ascending = [0,1]) 
#here in case of collission that two or moreunits sold rows are same it will jump to coffee type 
#to sort them out 
#0-> false (descending)
#1->true (ascending)

In [ ]:
#iterating the database using for loop 
for index, row in df.iterrows():
    print(index)
    print(row["Day"])
    print("\n")

0
Monday


1
Monday


2
Tuesday


3
Tuesday


4
Wednesday


5
Wednesday


6
Thursday


7
Thursday


8
Friday


9
Friday


10
Saturday


11
Saturday


12
Sunday


13
Sunday

In [63]:
#creating a copy of the dataset 
df2= df.copy()
df2.head()

         Day Coffee Type  Units Sold  price  updated price  revenue
0     Monday    Espresso          25   4.99           3.99    99.75
1     Monday       Latte          15   4.99           5.99    89.85
2    Tuesday    Espresso          30   4.99           3.99   119.70
3    Tuesday       Latte          20   4.99           5.99   119.80
4  Wednesday    Espresso          35   4.99           3.99   139.65

In [49]:
df_new= df.copy()
df_new.head()

         Day Coffee Type  Units Sold
0     Monday    Espresso        25.0
1     Monday       Latte        15.0
2    Tuesday    Espresso         NaN
3    Tuesday       Latte         NaN
4  Wednesday    Espresso        35.0

In [50]:
#adding new column
df_new["price"]= 4.99
df_new.head()

         Day Coffee Type  Units Sold  price
0     Monday    Espresso        25.0   4.99
1     Monday       Latte        15.0   4.99
2    Tuesday    Espresso         NaN   4.99
3    Tuesday       Latte         NaN   4.99
4  Wednesday    Espresso        35.0   4.99

In [51]:
#adding new column 
df_new["new price"]= np.where(df_new['Coffee Type']=='Espresso', 3.99, 5.99)
df_new.head()

         Day Coffee Type  Units Sold  price  new price
0     Monday    Espresso        25.0   4.99       3.99
1     Monday       Latte        15.0   4.99       5.99
2    Tuesday    Espresso         NaN   4.99       3.99
3    Tuesday       Latte         NaN   4.99       5.99
4  Wednesday    Espresso        35.0   4.99       3.99

In [52]:
#renaming a column 
df_new.rename(columns={"new price":"updated price"}, inplace = True)
df_new.head()

         Day Coffee Type  Units Sold  price  updated price
0     Monday    Espresso        25.0   4.99           3.99
1     Monday       Latte        15.0   4.99           5.99
2    Tuesday    Espresso         NaN   4.99           3.99
3    Tuesday       Latte         NaN   4.99           5.99
4  Wednesday    Espresso        35.0   4.99           3.99

In [53]:
#dropping a column 
df_new.drop(columns=['price'], inplace = True)

In [54]:
#maing a new column from existing column 
df_new["revenue"]= df_new["Units Sold"] * df_new["updated price"]
df_new.head()

         Day Coffee Type  Units Sold  updated price  revenue
0     Monday    Espresso        25.0           3.99    99.75
1     Monday       Latte        15.0           5.99    89.85
2    Tuesday    Espresso         NaN           3.99      NaN
3    Tuesday       Latte         NaN           5.99      NaN
4  Wednesday    Espresso        35.0           3.99   139.65

HANDLING NULL VALUES

In [19]:
#setting some values null 
df.loc[[2,3], 'Units Sold'] = np.nan

In [20]:
#getting info on null values
df.isna().sum()

Day            0
Coffee Type    0
Units Sold     2
dtype: int64

In [22]:
#filling null values 
#df.fillna(df['Units Sold'].mean())

#we can also use interpolate instead of mean 
#interpolate -> checks if there is a pattern in the data and fill null values accordingly
df['Units Sold'].interpolate()

0     25.000000
1     15.000000
2     21.666667
3     28.333333
4     35.000000
5     25.000000
6     40.000000
7     30.000000
8     45.000000
9     35.000000
10    45.000000
11    35.000000
12    45.000000
13    35.000000
Name: Units Sold, dtype: float64

In [ ]:
#we can directly drop the rows with null values using 
df.dropna()

#if you want to drop only when some specific column value is null then you can do 
df.dropna(subset=['Units Sold'], inplace = True)

#we can get rows with null values 
df[df['Units Sold'].isna()]

#the opposite that is getting rows which are not null then 
df[df['Units Sold'].notna()]

GROUPBY FUNCTION

In [55]:
df_new.head()

         Day Coffee Type  Units Sold  updated price  revenue
0     Monday    Espresso        25.0           3.99    99.75
1     Monday       Latte        15.0           5.99    89.85
2    Tuesday    Espresso         NaN           3.99      NaN
3    Tuesday       Latte         NaN           5.99      NaN
4  Wednesday    Espresso        35.0           3.99   139.65

In [56]:
#finding how much units were sold by each type of coffee
df_new.groupby(['Coffee Type'])['Units Sold'].sum()

Coffee Type
Espresso    235.0
Latte       175.0
Name: Units Sold, dtype: float64

In [57]:
#we can also perform different functions on different columns 
df_new.groupby(['Coffee Type']).agg({'Units Sold': 'sum', 'updated price': 'mean'})

             Units Sold  updated price
Coffee Type
Espresso          235.0           3.99
Latte             175.0           5.99

In [64]:
df_new = df_new.fillna(df_new['Units Sold'].mean())
df_new.head()

         Day Coffee Type  Units Sold  updated price     revenue
0     Monday    Espresso   25.000000           3.99   99.750000
1     Monday       Latte   15.000000           5.99   89.850000
2    Tuesday    Espresso   34.166667           3.99   34.166667
3    Tuesday       Latte   34.166667           5.99   34.166667
4  Wednesday    Espresso   35.000000           3.99  139.650000

In [66]:
#we can also reform the table according to our own needs 
#that is done by pivot 
pivot = df_new.pivot(columns='Coffee Type', index ='Day', values ='revenue')

In [ ]:
#a dataframe was made where columns were created on the basis of different values of the main column we passed 
#initialization. and the index and values are as we set giving us a custom data frame
pivot

Coffee Type    Espresso       Latte
Day
Friday       179.550000  209.650000
Monday        99.750000   89.850000
Saturday     179.550000  209.650000
Sunday       179.550000  209.650000
Thursday     159.600000  179.700000
Tuesday       34.166667   34.166667
Wednesday    139.650000  149.750000

In [ ]:
#giving sum of all the columns
pivot.sum()

Coffee Type
Espresso     971.816667
Latte       1082.416667
dtype: float64

In [ ]:
#giving sum of all the rows
pivot.sum(axis =1)

Day
Friday       389.200000
Monday       189.600000
Saturday     389.200000
Sunday       389.200000
Thursday     339.300000
Tuesday       68.333333
Wednesday    289.400000
dtype: float64

ADVANCED FUNCTIONS

In [72]:
#.shift() -> used to get previous values 
df_new ['yesterday_revenue']= df_new['revenue'].shift(1)
df_new.head()

,Day,Coffee Type,Units Sold,updated price,revenue,yesterday_revenue
0,Monday,Espresso,25.000000,3.99,99.750000,NaN
1,Monday,Latte,15.000000,5.99,89.850000,99.750000
2,Tuesday,Espresso,34.166667,3.99,34.166667,89.850000
3,Tuesday,Latte,34.166667,5.99,34.166667,34.166667
4,Wednesday,Espresso,35.000000,3.99,139.650000,34.166667

In [74]:
#rolling fucntions like cumulative sum 
df_new['cumulative_revenue']= df_new['revenue'].cumsum()
df_new.head()

,Day,Coffee Type,Units Sold,updated price,revenue,yesterday_revenue,cumulative_revenue
0,Monday,Espresso,25.000000,3.99,99.750000,NaN,99.750000
1,Monday,Latte,15.000000,5.99,89.850000,99.750000,189.600000
2,Tuesday,Espresso,34.166667,3.99,34.166667,89.850000,223.766667
3,Tuesday,Latte,34.166667,5.99,34.166667,34.166667,257.933333
4,Wednesday,Espresso,35.000000,3.99,139.650000,34.166667,397.583333

In [76]:
pd.__version__

'3.0.0'

In [ ]:
you can do ctrl + i to open git hub copilot